package backend.academy;

import java.util.Scanner;
import lombok.experimental.UtilityClass;

@UtilityClass
public class Main {

    String[][] natureWords = {
        {"лес", "река", "сад", "мох", "лист", "цвет", "дождь", "корень", "плод"},
        {"гора", "озеро", "цветок", "дерево", "животное", "птица", "солнце", "облако", "ветер", "земля",
            "океан", "пейзаж", "поляна"},
        {"экосистема", "биосфера", "фотосинтез", "ландшафтный", "океанография", "пейзажистка", "организмов",
            "субтропики", "природоохранный"}
    };

    String[][] sportsWords = {
        {"лук", "игра", "прыж", "бокс", "брас", "лед", "бег", "мост", "гонка", "топ"},
        {"футбол", "боксёр", "гимнаст", "велосипед", "плавание", "теннис", "хоккей", "спортсмен", "марафон", "бегунья"},
        {"спартакиада", "чемпионат", "паралимпийдец", "тренировка", "футболистка", "бодибилдинг", "сноубординг",
            "кроссфит", "качалка"}
    };

    //----------------------------------
    //--------------------------------------------------

    String[][] animalsWords = {
        {"кот", "пес", "лев", "крыса", "утка", "рыба", "мышь", "овца", "фазан", "жук"},
        {"тигр", "лошадь", "бобер", "кенгуру", "черепаха", "пингвин", "ящерица", "сова", "утконос"},
        {"носорог", "крокодил", "слоновидный", "моржевик", "гиена", "параллельный", "млекопитающее", "африканец",
            "дикобраз", "дельфиния"}
    };

    //-------------------------------------
    String[][] countriesWords = {
        {"сша", "иран", "япония", "чад", "перу", "ливия", "кипр", "фиджи", "мали", "нигер"},
        {"норвегия", "греция", "мексика",
            "филиппины"},
        {"бразилия", "узбекистан", "турция", "словения", "канада",
            "великобритания", "нидерланды", "эквадор", "республика", "бельгия", "австралия", "венесуэла", "парагвай"
        }
    };

    Scanner scan = new Scanner(System.in);

    public static void main(String[] args) {
        DrawingGallow g = new DrawingGallow();
//        final int maxError = 6;
//        for (int i = 0; i < maxError; i++) {
//            g.increment();
//            g.printGallows(System.out);
//        }

     //   int category = Chosen.chooseCategory(scan, System.out);
//        System.out.println(category);
        int level = Chosen.chooseLevel(scan, System.out);
//        System.out.println(level);

    }
}
